IRP/src/DataProcessors/ProductionWorkspace/ProductionWorkspace.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
 <name>ProductionWorkspace</name>
</mdclass:DataProcessor>

IRP/src/AccumulationRegisters/R7030T_ProductionPlanning/R7030T_ProductionPlanning.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>R7030T_ProductionPlanning</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PlanningDocument</name>
    <type>
      <types>DocumentRef.ProductionPlanning</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PlanningType</name>
    <type>
      <types>EnumRef.ProductionPlanningTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.MF_PlanningPeriods</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ProductionType</name>
    <type>
      <types>EnumRef.ProductionTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BillOfMaterials</name>
    <type>
      <types>CatalogRef.MF_BillOfMaterials</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/InformationRegisters/T7010S_BillOfMaterials/T7010S_BillOfMaterials.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T7010S_BillOfMaterials</name>
 <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>BillOfMaterials</name>
  <type>
   <types>CatalogRef.BillOfMaterials</types>
  </type>
 </resources>
 <resources>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </resources>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <resources>
  <name>BasisUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </resources>
 <resources>
  <name>BasisQuantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PlanningDocument</name>
  <type>
   <types>DocumentRef.ProductionPlanning</types>
  </type>
 </dimensions>
 <dimensions>
  <name>BusinessUnit</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>InputID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </dimensions>
 <dimensions>
  <name>OutputID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </dimensions>
 <dimensions>
  <name>UniqueID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </dimensions>
 <dimensions>
  <name>SurplusStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>WriteoffStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsProduct</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsSemiproduct</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsMaterial</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsService</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PlanningPeriod</name>
  <type>
   <types>CatalogRef.PlanningPeriods</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/PlanningPeriodTypes/PlanningPeriodTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>PlanningPeriodTypes</name>
 <enumValues>
  <name>Financial</name>
 </enumValues>
 <enumValues>
  <name>Manufacturing</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/ProductionPlanningTypes/ProductionPlanningTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ProductionPlanningTypes</name>
 <enumValues>
  <name>Planned</name>
 </enumValues>
 <enumValues>
  <name>Produced</name>
 </enumValues>
 <enumValues>
  <name>PlanAdjustment</name>
 </enumValues>
 <enumValues>
  <name>Closing</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/ProductionTypes/ProductionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProductionTypes</name>
  <enumValues>
    <name>Product</name>
  </enumValues>
  <enumValues>
    <name>Semiproduct</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Documents/Production/Production.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Production</name>
  <registerRecords>InformationRegister.T6020S_BatchKeysInfo</registerRecords>
  <registerRecords>AccumulationRegister.R6060T_CostOfGoodsSold</registerRecords>
  <registerRecords>AccumulationRegister.R7040T_ManualMaterialsCorretionInProduction</registerRecords>
  <registerRecords>AccumulationRegister.R6510B_StockBalance</registerRecords>
  <registerRecords>InformationRegister.T7051S_ProductionDurationDetails</registerRecords>
  <registerRecords>AccumulationRegister.R4010B_ActualStocks</registerRecords>
  <registerRecords>AccumulationRegister.R4050B_StockInventory</registerRecords>
  <registerRecords>AccumulationRegister.R7030T_ProductionPlanning</registerRecords>
  <registerRecords>AccumulationRegister.R4011B_FreeStocks</registerRecords>
  <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
  <registerRecords>AccumulationRegister.R7020T_MaterialPlanning</registerRecords>
  <registerRecords>AccumulationRegister.R4035B_IncomingStocks</registerRecords>
  <registerRecords>AccumulationRegister.R4012B_StockReservation</registerRecords>
  <registerRecords>InformationRegister.T6010S_BatchesInfo</registerRecords>
  <registerRecords>AccumulationRegister.R7010T_DetailingSupplies</registerRecords>
  <registerRecords>AccumulationRegister.R7050T_ProductionDurations</registerRecords>
  <registerRecords>AccumulationRegister.R6020B_BatchBalance</registerRecords>
  <registerRecords>AccumulationRegister.R4036B_IncomingStocksRequested</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>StoreProduction</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <attributes>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </attributes>
  <attributes>
    <name>BillOfMaterials</name>
    <type>
      <types>CatalogRef.BillOfMaterials</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionPlanning</name>
    <type>
      <types>DocumentRef.ProductionPlanning</types>
    </type>
  </attributes>
  <attributes>
    <name>Finished</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionType</name>
    <type>
      <types>EnumRef.ProductionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </attributes>
  <attributes>
    <name>ExtraCostAmountByRatio</name>
    <type>
      <types>DefinedType.typePercent</types>
    </type>
  </attributes>
  <attributes>
    <name>ExtraCostTaxAmountByRatio</name>
    <type>
      <types>DefinedType.typePercent</types>
    </type>
  </attributes>
  <attributes>
    <name>DurationOfProduction</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransactionType</name>
    <type>
      <types>EnumRef.ProductionTransactionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ExtraDirectCostAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>ExtraDirectCostTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Materials</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>UniqueID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ItemBOM</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKeyBOM</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>UnitBOM</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityBOM</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>IsManualChanged</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>MaterialType</name>
      <type>
        <types>EnumRef.MaterialTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>WriteoffStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Catalogs/PlanningPeriods/PlanningPeriods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PlanningPeriods</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>BeginDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>IsFinancial</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>IsManufacturing</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>IsSalary</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>BusinessUnits</name>
  <attributes>
   <name>BusinessUnit</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/DataProcessors/ProductionWorkspace/Forms/Form/Module.bsl
&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "NewBarcode" And IsInputAvailable() Then
		SearchByBarcode(Undefined, Parameter);
	EndIf;
EndProcedure

&AtClient
Procedure SearchByBarcode(Command, Barcode = "")
	If Not ValueIsFilled(Barcode) Then
		Return;
	EndIf;
	DocumentsClient.SearchByBarcode(Barcode, Object, ThisObject, ThisObject);
EndProcedure

&AtClient
Async Procedure InputBarcode(Command)
	Barcode = "";
	Barcode = Await InputStringAsync(Barcode);
	SearchByBarcode(Undefined, Barcode);
EndProcedure

&AtClient
Procedure PlanningRefreshRequestProcessing(Item)
	PlanningRefreshRequestProcessingAtServer();
EndProcedure

&AtServer
Procedure PlanningRefreshRequestProcessingAtServer()
	If ThisObject.ItemKey.IsEmpty() Then
		ThisObject.Planning.Clear();
		Return;
	EndIf;
	Query = New Query;
	Query.Text =
	"SELECT
	|	PlanningPeriods.Ref AS PlanningPeriod
	|INTO PlanningPeriods
	|FROM
	|	Catalog.PlanningPeriods AS PlanningPeriods
	|WHERE
	|	PlanningPeriods.Type = VALUE(Enum.PlanningPeriodTypes.Manufacturing)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ISNULL(Planned.Company, Correction.Company) AS Company,
	|	ISNULL(Planned.BusinessUnit, Correction.BusinessUnit) AS BusinessUnit,
	|	ISNULL(Planned.ItemKey, Correction.ItemKey) AS ItemKey,
	|	ISNULL(Planned.PlanningType, Correction.PlanningType) AS PlanningType,
	|	ISNULL(Planned.PlanningPeriod, Correction.PlanningPeriod) AS PlanningPeriod,
	|	ISNULL(Planned.BillOfMaterials, Correction.BillOfMaterials) AS BillOfMaterials,
	|	ISNULL(Planned.PlanningDocument, Correction.PlanningDocument) AS PlanningDocument,
	|	MAX(ISNULL(Planned.QuantityTurnover, 0) + ISNULL(Correction.QuantityTurnover, 0)) AS Quantity
	|INTO Planned
	|FROM
	|	AccumulationRegister.R7030T_ProductionPlanning.Turnovers(,,, PlanningPeriod IN
	|		(SELECT
	|			PlanningPeriods.PlanningPeriod
	|		FROM
	|			PlanningPeriods)
	|	AND PlanningType = VALUE(Enum.ProductionPlanningTypes.Planned)
	|	AND ItemKey = &ItemKey) AS Planned
	|		FULL JOIN AccumulationRegister.R7030T_ProductionPlanning.Turnovers(,,, PlanningPeriod IN
	|			(SELECT
	|				PlanningPeriods.PlanningPeriod
	|			FROM
	|				PlanningPeriods AS PlanningPeriods)
	|		AND PlanningType = VALUE(Enum.ProductionPlanningTypes.PlanAdjustment)
	|		AND ItemKey = &ItemKey) AS Correction
	|		ON Planned.Company = Correction.Company
	|		AND Planned.BusinessUnit = Correction.BusinessUnit
	|		AND Planned.ItemKey = Correction.ItemKey
	|		AND Planned.PlanningPeriod = Correction.PlanningPeriod
	|		AND Planned.ProductionType = Correction.ProductionType
	|		AND Planned.BillOfMaterials = Correction.BillOfMaterials
	|GROUP BY
	|	ISNULL(Planned.Company, Correction.Company),
	|	ISNULL(Planned.BusinessUnit, Correction.BusinessUnit),
	|	ISNULL(Planned.ItemKey, Correction.ItemKey),
	|	ISNULL(Planned.PlanningType, Correction.PlanningType),
	|	ISNULL(Planned.PlanningPeriod, Correction.PlanningPeriod),
	|	ISNULL(Planned.BillOfMaterials, Correction.BillOfMaterials),
	|	ISNULL(Planned.PlanningDocument, Correction.PlanningDocument)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Produced.Company AS Company,
	|	Produced.BusinessUnit AS BusinessUnit,
	|	Produced.ItemKey AS ItemKey,
	|	Produced.PlanningType AS PlanningType,
	|	Produced.PlanningPeriod AS PlanningPeriod,
	|	Produced.BillOfMaterials AS BillOfMaterials,
	|	Produced.PlanningDocument AS PlanningDocument,
	|	Produced.QuantityTurnover AS Quantity
	|INTO Produced
	|FROM
	|	AccumulationRegister.R7030T_ProductionPlanning.Turnovers(,,, PlanningPeriod IN
	|		(SELECT
	|			PlanningPeriods.PlanningPeriod
	|		FROM
	|			PlanningPeriods AS PlanningPeriods)
	|	AND PlanningType = VALUE(Enum.ProductionPlanningTypes.Produced)
	|	AND ItemKey = &ItemKey) AS Produced
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Closing.Company AS Company,
	|	Closing.BusinessUnit AS BusinessUnit,
	|	Closing.ItemKey AS ItemKey,
	|	Closing.PlanningType AS PlanningType,
	|	Closing.PlanningPeriod AS PlanningPeriod,
	|	Closing.BillOfMaterials AS BillOfMaterials,
	|	Closing.PlanningDocument AS PlanningDocument,
	|	Closing.QuantityTurnover AS Quantity
	|INTO Closing
	|FROM
	|	AccumulationRegister.R7030T_ProductionPlanning.Turnovers(,,, PlanningPeriod IN
	|		(SELECT
	|			PlanningPeriods.PlanningPeriod
	|		FROM
	|			PlanningPeriods AS PlanningPeriods)
	|	AND PlanningType = VALUE(Enum.ProductionPlanningTypes.Closing)
	|	AND ItemKey = &ItemKey) AS Closing
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Planned.Company AS Company,
	|	Planned.BusinessUnit AS BusinessUnit,
	|	Planned.ItemKey.Item AS Item,
	|	Planned.ItemKey AS ItemKey,
	|	Planned.PlanningPeriod AS PlanningPeriod,
	|	Planned.BillOfMaterials AS BillOfMaterials,
	|	Planned.PlanningDocument AS PlanningDocument,
	|	Planned.Quantity - ISNULL(Produced.Quantity, 0) AS BasisQuantity
	|INTO PlannedProducedTmp
	|FROM
	|	Planned AS Planned
	|		LEFT JOIN Produced AS Produced
	|		ON Planned.Company = Produced.Company
	|		AND Planned.BusinessUnit = Produced.BusinessUnit
	|		AND Planned.ItemKey = Produced.ItemKey
	|		AND Planned.PlanningPeriod = Produced.PlanningPeriod
	|		AND Planned.BillOfMaterials = Produced.BillOfMaterials
	|		AND Planned.PlanningDocument = Produced.PlanningDocument
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	PlannedProducedTmp.Company AS Company,
	|	PlannedProducedTmp.BusinessUnit AS BusinessUnit,
	|	PlannedProducedTmp.ItemKey.Item AS Item,
	|	PlannedProducedTmp.ItemKey AS ItemKey,
	|	PlannedProducedTmp.PlanningPeriod AS PlanningPeriod,
	|	PlannedProducedTmp.BillOfMaterials AS BillOfMaterials,
	|	PlannedProducedTmp.PlanningDocument AS PlanningDocument,
	|	PlannedProducedTmp.BasisQuantity + ISNULL(Closing.Quantity, 0) AS BasisQuantity
	|INTO PlannedProduced
	|FROM
	|	PlannedProducedTmp AS PlannedProducedTmp
	|		LEFT JOIN Closing AS Closing
	|		ON PlannedProducedTmp.Company = Closing.Company
	|		AND PlannedProducedTmp.BusinessUnit = Closing.BusinessUnit
	|		AND PlannedProducedTmp.ItemKey = Closing.ItemKey
	|		AND PlannedProducedTmp.PlanningPeriod = Closing.PlanningPeriod
	|		AND PlannedProducedTmp.BillOfMaterials = Closing.BillOfMaterials
	|		AND PlannedProducedTmp.PlanningDocument = Closing.PlanningDocument
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	PlannedProduced.PlanningDocument AS PlanningDocument,
	|	PlannedProduced.Company AS Company,
	|	PlannedProduced.BusinessUnit AS BusinessUnit,
	|	T7010S_BillOfMaterials.SurplusStore AS StoreProduction,
	|	PlannedProduced.Item AS Item,
	|	PlannedProduced.ItemKey AS ItemKey,
	|	PlannedProduced.PlanningPeriod AS PlanningPeriod,
	|	PlannedProduced.BasisQuantity AS BasisQuantity,
	|	T7010S_BillOfMaterials.BasisUnit AS BasisUnit,
	|	T7010S_BillOfMaterials.BillOfMaterials AS BillOfMaterials,
	|	T7010S_BillOfMaterials.BasisQuantity AS TotalQuantity,
	|	T7010S_BillOfMaterials.OutputID AS OutputID,
	|	T7010S_BillOfMaterials.UniqueID AS UniqueID
	|INTO Production
	|FROM
	|	PlannedProduced AS PlannedProduced
	|		INNER JOIN InformationRegister.T7010S_BillOfMaterials.SliceLast AS T7010S_BillOfMaterials
	|		ON (T7010S_BillOfMaterials.Company = PlannedProduced.Company)
	|		AND (T7010S_BillOfMaterials.BusinessUnit = PlannedProduced.BusinessUnit)
	|		AND (T7010S_BillOfMaterials.ItemKey = PlannedProduced.ItemKey)
	|		AND (T7010S_BillOfMaterials.IsProduct = TRUE)
	|		AND (T7010S_BillOfMaterials.PlanningPeriod = PlannedProduced.PlanningPeriod)
	|		AND (T7010S_BillOfMaterials.BillOfMaterials = PlannedProduced.BillOfMaterials)
	|		AND (T7010S_BillOfMaterials.PlanningDocument = PlannedProduced.PlanningDocument)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	PlannedProduced.PlanningDocument AS PlanningDocument,
	|	PlannedProduced.Company AS Company,
	|	PlannedProduced.BusinessUnit AS BusinessUnit,
	|	T7010S_BillOfMaterials.SurplusStore AS StoreProduction,
	|	PlannedProduced.Item AS Item,
	|	PlannedProduced.ItemKey AS ItemKey,
	|	PlannedProduced.PlanningPeriod AS PlanningPeriod,
	|	PlannedProduced.BasisQuantity AS BasisQuantity,
	|	T7010S_BillOfMaterials.BasisUnit AS BasisUnit,
	|	T7010S_BillOfMaterials.BillOfMaterials AS BillOfMaterials,
	|	T7010S_BillOfMaterials.BasisQuantity AS TotalQuantity,
	|	T7010S_BillOfMaterials.OutputID AS OutputID,
	|	T7010S_BillOfMaterials.UniqueID AS UniqueID
	|INTO Semiproduction
	|FROM
	|	PlannedProduced AS PlannedProduced
	|		INNER JOIN InformationRegister.T7010S_BillOfMaterials.SliceLast AS T7010S_BillOfMaterials
	|		ON (T7010S_BillOfMaterials.Company = PlannedProduced.Company)
	|		AND (T7010S_BillOfMaterials.BusinessUnit = PlannedProduced.BusinessUnit)
	|		AND (T7010S_BillOfMaterials.ItemKey = PlannedProduced.ItemKey)
	|		AND (T7010S_BillOfMaterials.IsSemiproduct = TRUE)
	|		AND (T7010S_BillOfMaterials.PlanningPeriod = PlannedProduced.PlanningPeriod)
	|		AND (T7010S_BillOfMaterials.BillOfMaterials = PlannedProduced.BillOfMaterials)
	|		AND (T7010S_BillOfMaterials.PlanningDocument = PlannedProduced.PlanningDocument)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Production.PlanningDocument AS ProductionPlanning,
	|	VALUE(Enum.ProductionTypes.Product) AS ProductionType,
	|	Production.Company AS Company,
	|	Production.BusinessUnit AS BusinessUnit,
	|	Production.StoreProduction AS StoreProduction,
	|	Production.Item AS Item,
	|	Production.ItemKey AS ItemKey,
	|	Production.PlanningPeriod AS PlanningPeriod,
	|	Production.BasisQuantity AS LeftToProduce,
	|	Production.BasisUnit AS BasisUnit,
	|	Production.BillOfMaterials AS BillOfMaterials,
	|	Production.TotalQuantity AS TotalQuantity,
	|	Production.OutputID AS OutputID,
	|	Production.UniqueID AS UniqueID
	|FROM
	|	Production AS Production
	|WHERE
	|	Production.BasisQuantity > 0
	|
	|UNION ALL
	|
	|SELECT
	|	Semiproduction.PlanningDocument,
	|	VALUE(Enum.ProductionTypes.Semiproduct),
	|	Semiproduction.Company,
	|	Semiproduction.BusinessUnit,
	|	Semiproduction.StoreProduction,
	|	Semiproduction.Item,
	|	Semiproduction.ItemKey,
	|	Semiproduction.PlanningPeriod,
	|	Semiproduction.BasisQuantity,
	|	Semiproduction.BasisUnit,
	|	Semiproduction.BillOfMaterials,
	|	Semiproduction.TotalQuantity,
	|	Semiproduction.OutputID,
	|	Semiproduction.UniqueID
	|FROM
	|	Semiproduction AS Semiproduction
	|WHERE
	|	Semiproduction.BasisQuantity > 0";
	
	Query.SetParameter("CurrentDate", BegOfDay(CurrentSessionDate()));
	Query.SetParameter("ItemKey", ItemKey);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	ThisObject.Planning.Clear();
	While QuerySelection.Next() Do
		NewRow = ThisObject.Planning.Add();
		FillPropertyValues(NewRow, QuerySelection);
	EndDo;
EndProcedure

&AtServer
Procedure Clear()
	Planning.Clear();
	Item = Undefined;
	ItemKey = Undefined;
	Unit = Undefined;
	Quantity = 0;

	EnableButtons();
EndProcedure

&AtClient
Procedure QuantityOnChange()
	EnableButtons();
EndProcedure

&AtServer
Procedure EnableButtons()
	Items.Productions.Enabled = Quantity;
	Items.InventoryTransfer.Enabled = Quantity;
	Items.ProductionPlusInventoryTransfer.Enabled = Quantity;
EndProcedure

&AtClient
Async Procedure SearchByBarcodeEnd(Result, AdditionalParameters) Export
	If Not Result.FoundedItems.Count()
		And Result.Barcodes.Count() Then
		CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().S_019, Result.Barcodes[0]));
		Return;
	EndIf;

	NotifyParameters = New Structure();
	NotifyParameters.Insert("Form"   , ThisObject);
	NotifyParameters.Insert("Object" , ThisObject);

	For Each Row In Result.FoundedItems Do
		Item = Row.Item;
		ItemKey = Row.ItemKey;
		Unit = Row.Unit;
		
		PlanningRefreshRequestProcessingAtServer();
		
		ThisObject.CurrentItem = Items.Quantity;
#If MobileClient Then
		BeginEditingItem();
#EndIf
	EndDo;

EndProcedure

&AtClient
Procedure ItemKeyOnChange(Item)
	PlanningRefreshRequestProcessingAtServer();
EndProcedure

&AtClient
Procedure Productions(Command)
	If Items.Planning.CurrentData = Undefined Then
		CommonFunctionsClientServer.ShowUsersMessage(R().MF_Error_010);
		Return;
	EndIf;
	CreateDocuments(GetParametersForDocProduction(Items.Planning.CurrentData));
EndProcedure

&AtClient
Procedure InventoryTransfer(Command)	
	If Items.Planning.CurrentData = Undefined Then
		CommonFunctionsClientServer.ShowUsersMessage(R().MF_Error_010);
		Return;
	EndIf;
	CreateDocuments(Undefined, GetParametersForDocInventoryTransfer(Items.Planning.CurrentData));
EndProcedure

&AtClient
Procedure ProductionPlusInventoryTransfer(Command)
	If Items.Planning.CurrentData = Undefined Then
		CommonFunctionsClientServer.ShowUsersMessage(R().MF_Error_010);
		Return;
	EndIf;
	CreateDocuments(GetParametersForDocProduction(Items.Planning.CurrentData),
		GetParametersForDocInventoryTransfer(Items.Planning.CurrentData));
EndProcedure

&AtClient
Function GetParametersForDocProduction(PlanningCurrentData)
	Result = New Structure();
	Result.Insert("Company"            , PlanningCurrentData.Company);
	Result.Insert("PlanningPeriod"     , PlanningCurrentData.PlanningPeriod);
	Result.Insert("ProductionPlanning" , PlanningCurrentData.ProductionPlanning);
	Result.Insert("ItemKey"            , ThisObject.ItemKey);
	Result.Insert("Unit"               , ThisObject.Unit);
	Result.Insert("Quantity"           , ThisObject.Quantity);
	Result.Insert("BillOfMaterials"    , PlanningCurrentData.BillOfMaterials);
	Result.Insert("TotalQuantity"      , PlanningCurrentData.TotalQuantity);
	Result.Insert("OutputID"           , PlanningCurrentData.OutputID);
	Result.Insert("UniqueID"           , PlanningCurrentData.UniqueID);
	Result.Insert("ProductionType"     , PlanningCurrentData.ProductionType);
	Result.Insert("BusinessUnit"       , PlanningCurrentData.BusinessUnit);
	Result.Insert("StoreProduction"    , PlanningCurrentData.StoreProduction);
	Return Result;
EndFunction

&AtClient
Function GetParametersForDocInventoryTransfer(PlanningCurrentData)
	Result = New Structure("BasedOn", "ProductionPlanning");
	Result.Insert("Company"            , PlanningCurrentData.Company);
	Result.Insert("StoreSender"        , PlanningCurrentData.StoreProduction);
	Result.Insert("Branch"             , 
		CommonFunctionsServer.GetRefAttribute(PlanningCurrentData.ProductionPlanning, "BusinessUnit"));
	
	Result.Insert("ItemList", New Array());
	Result.ItemList.Add(New Structure("Item, ItemKey, Unit, Quantity, ProductionPlanning", 
		ThisObject.Item, ThisObject.ItemKey, ThisObject.Unit, ThisObject.Quantity, PlanningCurrentData.ProductionPlanning));
	
	Return Result;
EndFunction

&AtServer
Procedure CreateDocuments(Parameters_Production = Undefined, Parameters_InventoryTransfer = Undefined)
	Production_IsCreated = False;
	NewProduction = Undefined;
	
	InventoryTransfer_IsCreated = False;
	NewInventoryTransfer = Undefined;
	
	BeginTransaction();
	CreationDate = CommonFunctionsServer.GetCurrentSessionDate();
	If Parameters_Production <> Undefined Then
		NewProduction = Documents.Production.CreateDocument();
		NewProduction.Date = CreationDate;
		FillingData = ManufacturingServer.GetProductionFillingData(Parameters_Production);
		NewProduction.Fill(FillingData);		
		NewProduction.Write(DocumentWriteMode.Posting);
		Production_IsCreated = True;
	EndIf;

	If Parameters_InventoryTransfer <> Undefined Then
		NewInventoryTransfer = Documents.InventoryTransfer.CreateDocument();
		NewInventoryTransfer.Date = CreationDate +1;
		NewInventoryTransfer.Fill(Parameters_InventoryTransfer);
		NewInventoryTransfer.Write(DocumentWriteMode.Posting);
		InventoryTransfer_IsCreated = True;
	EndIf;
	CommitTransaction();

	Clear();
	
	If Production_IsCreated Then
		ThisObject.DocProduction = NewProduction.Ref;
	EndIf;
	
	If InventoryTransfer_IsCreated Then
		ThisObject.DocInventoryTransfer = NewInventoryTransfer.Ref;
	EndIf;	
	Items.ButtonPages.CurrentPage = Items.GroupDocuments;
EndProcedure
